---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RevitLinkOptions
source: html/bb2fe839-10a9-9e30-2567-da676967332a.htm
---
# RevitLinkOptions Members

Creates a RevitLinkOptions object, specifying relative or absolute path type.
 If the link is workshared, all worksets will be opened.